---
# <center> <b> TTL LAB 8: Pandas in Python </b>

### Name: Ayush Priyam
### Roll: 20051933
### Date: 21st March 2023

---

In [77]:
import pandas as pd
import numpy as np

Q1. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.

In [78]:
a1= pd.Series([1,2,3])
a2= pd.Series([11,15,20])
print("ADD:\n", a1+a2)
print("\nSubtract:\n", a1-a2)
print("\nMultiply:\n",a1*a2)

ADD:
 0    12
1    17
2    23
dtype: int64

Subtract:
 0   -10
1   -13
2   -17
dtype: int64

Multiply:
 0    11
1    30
2    60
dtype: int64

---
Q2. Write a Pandas program to convert a dictionary to a Pandas series.

In [79]:
d= {'a': 100, 'b': 200, 'c':300, 'd':400, 'e':500}
s= pd.Series(d)
s

a    100
b    200
c    300
d    400
e    500
dtype: int64

---
Q3. Write a Pandas program to convert a NumPy array to a Pandas series.

In [80]:
s1= pd.Series(np.array([4,5,6,10]))
s1

0     4
1     5
2     6
3    10
dtype: int32

---
Q4. Write a Pandas program to convert a given Series to an array.

In [81]:
a4= np.array(s1)
a4

array([ 4,  5,  6, 10])

---
Q5. Write a Pandas program to convert Series of lists to one Series.

In [82]:
s2 = pd.Series([[2, 4, 6, 8],
               [1, 3, 5, 7],
                [11, 22, 33, 44]])
print("Original Series:\n", s2)
s3 = s.apply(pd.Series).stack().reset_index(drop=True)
print("Stacked Series:", s3)

Original Series:
 0        [2, 4, 6, 8]
1        [1, 3, 5, 7]
2    [11, 22, 33, 44]
dtype: object
Stacked Series: 0    100
1    200
2    300
3    400
4    500
dtype: int64

---
Q6. Write a Pandas program to create a dataframe from a dictionary and display it.

In [83]:
d1 = {'a': [100, 200, 300], 'b': [600, 500,300]}
df1 = pd.DataFrame.from_dict(d1)
df1

     a    b
0  100  600
1  200  500
2  300  300

---
Q7. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [84]:
df2= pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9],[8,9,10]]))
df2.head(3)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

---
Q8. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

Sample Python dictionary data and list labels:<br>
exam_data = {'name';: ['Anastasia';, 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
'Kevin', 'Jonas'],<br>
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],<br>
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],<br>
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}<br>
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']<br>

Expected Output:<br>
name score<br>
a Anastasia 12.5<br>
b Dima 9.0<br>
c Katherine 16.5<br>
...<br> h Laura NaN<br>
i Kevin 8.0<br>
j Jonas 19.0

In [85]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura',
                      'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df3 = pd.DataFrame(exam_data, index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
df3[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

---
Q9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.<br>
Expected Output:<br>
Rows where score is missing:<br>
    attempts name  qualify score<br>
d       3    James  no     NaN<br>
h        1   Laura  no     NaN

In [86]:
df3[df3['score'].isnull()][['attempts','name','qualify','score']]

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

---
Q10. Write a Pandas program to append a new row &
delete the new row and return the original DataFrame.

In [87]:
df4 = pd.DataFrame({'name': 'Suresh', 'score': '15.5',
                  'attempts': '1', 'qualify': 'yes'}, index=['k'])
dfc= pd.concat([df3,df4])
print("Concatenated df:\n")
dfc

Concatenated df:

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes
k     Suresh  15.5        1     yes

In [88]:
dfr = dfc.drop('k')# deleting row
print("\nRemoved row:")
dfr

Removed row:

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James   NaN        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes